#### Import Data

In [17]:
import pandas as pd
df = pd.read_csv("dataset.csv")
#df.set_option("display.max_columns",None)
df[df["experience_level"] == "EN"]["job_title"].value_counts()

job_title
Data Engineer                         66
Data Analyst                          63
Data Scientist                        59
Machine Learning Engineer             21
Research Engineer                     10
Research Scientist                     9
AI Scientist                           7
Data Science Consultant                7
Applied Scientist                      6
AI Developer                           6
BI Data Analyst                        6
Business Data Analyst                  6
Machine Learning Developer             5
Computer Vision Engineer               4
Big Data Engineer                      4
Computer Vision Software Engineer      3
Applied Data Scientist                 3
Machine Learning Research Engineer     3
AI Programmer                          2
Applied Machine Learning Scientist     2
ML Engineer                            2
Data Manager                           2
Machine Learning Scientist             2
BI Analyst                             2
3D Computer Vision Researcher          2
Data Analytics Engineer                2
Deep Learning Engineer                 2
BI Developer                           2
Compliance Data Analyst                1
Data Analytics Consultant              1
BI Data Engineer                       1
Machine Learning Software Engineer     1
Product Data Analyst                   1
Autonomous Vehicle Technician          1
Data Quality Analyst                   1
Data Specialist                        1
Analytics Engineer                     1
Financial Data Analyst                 1
Marketing Data Engineer                1
Power BI Developer                     1
Name: count, dtype: int64

#### Checking for nulls

In [18]:
df.info()
df.isnull().any()

# No nulls detected

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3761 entries, 0 to 3760
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         3761 non-null   int64
 1   experience_level  3761 non-null   object
 2   employment_type   3761 non-null   object
 3   job_title         3761 non-null   object
 4   salary            3761 non-null   int64
 5   salary_currency   3761 non-null   object
 6   salary_in_usd     3761 non-null   int64
 7   company_location  3761 non-null   object
 8   company_size      3761 non-null   object
dtypes: int64(3), object(6)
memory usage: 264.6+ KB

work_year           False
experience_level    False
employment_type     False
job_title           False
salary              False
salary_currency     False
salary_in_usd       False
company_location    False
company_size        False
dtype: bool

#### Checking for duplicates

In [19]:
df.duplicated(keep="first").any()

## Duplicates are present, keeping them in for now, as it is possible for different people to have the same job w/ same salary

True

#### Adding column for currency in MYR

In [20]:
df["salary_in_myr"] = df["salary_in_usd"] * 4.71
df["salary_in_myr"] = df["salary_in_myr"].astype("int")
df[["job_title","salary_in_usd","salary_in_myr"]]

## Added column for currency in MYR, converted to int to remove decimal values

                      job_title  salary_in_usd  salary_in_myr
0             Applied Scientist         213660        1006338
1             Applied Scientist         130760         615879
2          Data Quality Analyst         100000         471000
3       Compliance Data Analyst          30000         141300
4             Applied Scientist         204620         963760
...                         ...            ...            ...
3756   Principal Data Scientist         148261         698309
3757             Data Scientist          91237         429726
3758       Data Science Manager         190200         895842
3759  Machine Learning Engineer          45618         214860
3760             Data Scientist         412000        1940520

[3761 rows x 3 columns]

#### Converting location names to full name

In [31]:
df[df["company_location"] == "IN"]["salary_in_usd"].mean()

30197.741379310344

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3761 entries, 0 to 3760
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         3761 non-null   int64
 1   experience_level  3761 non-null   object
 2   employment_type   3761 non-null   object
 3   job_title         3761 non-null   object
 4   salary            3761 non-null   int64
 5   salary_currency   3761 non-null   object
 6   salary_in_usd     3761 non-null   int64
 7   company_location  3761 non-null   object
 8   company_size      3761 non-null   object
 9   salary_in_myr     3761 non-null   int32
dtypes: int32(1), int64(3), object(6)
memory usage: 279.3+ KB

In [21]:
import pycountry

df['country_name'] = df['company_location'].map(lambda x: pycountry.countries.get(alpha_2=x).name)
df.groupby("country_name")['company_location'].unique()

ModuleNotFoundError: No module named 'pycountry'

In [ ]:
df['country_name'].value_counts()

NameError: name 'df' is not defined

#### Creating column for country's continent

In [ ]:
def country_to_continent(country_name):
    country_alpha2 = pycountry.country_name_to_country_alpha2(country_name)
    country_continent_code = pycountry.country_alpha2_to_continent_code(country_alpha2)
    country_continent_name = pycountry.convert_continent_code_to_continent_name(country_continent_code)
    return country_continent_name

# Example
country_name = 'Germany'
print(country_to_continent(country_name))

df['continent_name'] = df['country_name'].map(lambda x: country_to_continent(x))

#### Exporting to processed_data.csv

In [ ]:
df.to_csv("processed_data.csv", index = False)

## saved to processed_data.csv